portable_artifacts/CfdOF_case/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 50.0;

boundaryField
{

    outlet(top)
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }

    wall(tank_vertical)
    {
        type        epsilonWallFunction;
        value       $internalField;
    }

    inlet(ring)
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.1;
        value           $internalField;
    }

    defaultFaces
    {
        type        epsilonWallFunction;
        value       $internalField;
    }

}

// ************************************************************************* //
